dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f052_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32F052_gpio_v1_0_Modes.xml*/

#if !defined(_STM32F052_PINMUX_H_)
# define _STM32F052_PINMUX_H_

#define CAN_RX_FUNC              0
#define CAN1_RX_FUNC             0
#define CAN_TX_FUNC              1
#define CAN1_TX_FUNC             1
#define CEC_FUNC                 2
#define COMP1_OUT_FUNC           3
#define COMP2_OUT_FUNC           4
#define CRS_SYNC_FUNC            5
#define EVENTOUT_FUNC            6
#define I2C1_SCL_FUNC            7
#define I2C1_SDA_FUNC            8
#define I2C1_SMBA_FUNC           9
#define I2C2_SCL_FUNC            10
#define I2C2_SDA_FUNC            11
#define I2S1_CK_FUNC             12
#define I2S1_MCK_FUNC            13
#define I2S1_SD_FUNC             14
#define I2S1_WS_FUNC             15
#define I2S2_CK_FUNC             16
#define I2S2_MCK_FUNC            17
#define I2S2_SD_FUNC             18
#define I2S2_WS_FUNC             19
#define IR_OUT_FUNC              20
#define RCC_MCO_FUNC             21
#define SPI1_MISO_FUNC           22
#define SPI1_MOSI_FUNC           23
#define SPI1_NSS_FUNC            24
#define SPI1_SCK_FUNC            25
#define SPI2_MISO_FUNC           26
#define SPI2_MOSI_FUNC           27
#define SPI2_NSS_FUNC            28
#define SPI2_SCK_FUNC            29
#define SYS_CAN_FUNC             30
#define SYS_CAN1_FUNC            30
#define SYS_COMP_FUNC            31
#define SYS_DAC_FUNC             32
#define SYS_I2C_FUNC             33
#define SYS_IR_Out_FUNC          34
#define SYS_SPI_FUNC             35
#define SYS_SWCLK_FUNC           36
#define SYS_SWDIO_FUNC           37
#define SYS_SYSTEM_FUNC          38
#define SYS_TIM1_FUNC            39
#define SYS_TIM14_FUNC           40
#define SYS_TIM15_FUNC           41
#define SYS_TIM16_FUNC           42
#define SYS_TIM17_FUNC           43
#define SYS_TIM2_FUNC            44
#define SYS_TIM3_FUNC            45
#define SYS_TOUCH_FUNC           46
#define SYS_USART_FUNC           47
#define SYS_UART_FUNC            47
#define TIM14_CH1_FUNC           48
#define TIM15_BKIN_FUNC          49
#define TIM15_CH1_FUNC           50
#define TIM15_CH1N_FUNC          51
#define TIM15_CH2_FUNC           52
#define TIM16_BKIN_FUNC          53
#define TIM16_CH1_FUNC           54
#define TIM16_CH1N_FUNC          55
#define TIM17_BKIN_FUNC          56
#define TIM17_CH1_FUNC           57
#define TIM17_CH1N_FUNC          58
#define TIM1_BKIN_FUNC           59
#define TIM1_CH1_FUNC            60
#define TIM1_CH1N_FUNC           61
#define TIM1_CH2_FUNC            62
#define TIM1_CH2N_FUNC           63
#define TIM1_CH3_FUNC            64
#define TIM1_CH3N_FUNC           65
#define TIM1_CH4_FUNC            66
#define TIM1_ETR_FUNC            67
#define TIM2_CH1_FUNC            68
#define TIM2_CH2_FUNC            69
#define TIM2_CH3_FUNC            70
#define TIM2_CH4_FUNC            71
#define TIM2_ETR_FUNC            72
#define TIM3_CH1_FUNC            73
#define TIM3_CH2_FUNC            74
#define TIM3_CH3_FUNC            75
#define TIM3_CH4_FUNC            76
#define TIM3_ETR_FUNC            77
#define TSC_G1_IO1_FUNC          78
#define TSC_G1_IO2_FUNC          79
#define TSC_G1_IO3_FUNC          80
#define TSC_G1_IO4_FUNC          81
#define TSC_G2_IO1_FUNC          82
#define TSC_G2_IO2_FUNC          83
#define TSC_G2_IO3_FUNC          84
#define TSC_G2_IO4_FUNC          85
#define TSC_G3_IO1_FUNC          86
#define TSC_G3_IO2_FUNC          87
#define TSC_G3_IO3_FUNC          88
#define TSC_G3_IO4_FUNC          89
#define TSC_G4_IO1_FUNC          90
#define TSC_G4_IO2_FUNC          91
#define TSC_G4_IO3_FUNC          92
#define TSC_G4_IO4_FUNC          93
#define TSC_G5_IO1_FUNC          94
#define TSC_G5_IO2_FUNC          95
#define TSC_G5_IO3_FUNC          96
#define TSC_G5_IO4_FUNC          97
#define TSC_G6_IO1_FUNC          98
#define TSC_G6_IO2_FUNC          99
#define TSC_G6_IO3_FUNC          100
#define TSC_G6_IO4_FUNC          101
#define TSC_G7_IO1_FUNC          102
#define TSC_G7_IO2_FUNC          103
#define TSC_G7_IO3_FUNC          104
#define TSC_G7_IO4_FUNC          105
#define TSC_G8_IO1_FUNC          106
#define TSC_G8_IO2_FUNC          107
#define TSC_G8_IO3_FUNC          108
#define TSC_G8_IO4_FUNC          109
#define TSC_SYNC_FUNC            110
#define USART1_CK_FUNC           111
#define UART1_CK_FUNC            111
#define USART1_CTS_FUNC          112
#define UART1_CTS_FUNC           112
#define USART1_DE_FUNC           113
#define UART1_DE_FUNC            113
#define USART1_RTS_FUNC          114
#define UART1_RTS_FUNC           114
#define USART1_RX_FUNC           115
#define UART1_RX_FUNC            115
#define USART1_TX_FUNC           116
#define UART1_TX_FUNC            116
#define USART2_CK_FUNC           117
#define UART2_CK_FUNC            117
#define USART2_CTS_FUNC          118
#define UART2_CTS_FUNC           118
#define USART2_DE_FUNC           119
#define UART2_DE_FUNC            119
#define USART2_RTS_FUNC          120
#define UART2_RTS_FUNC           120
#define USART2_RX_FUNC           121
#define UART2_RX_FUNC            121
#define USART2_TX_FUNC           122
#define UART2_TX_FUNC            122
#define USART3_CK_FUNC           123
#define UART3_CK_FUNC            123
#define USART3_CTS_FUNC          124
#define UART3_CTS_FUNC           124
#define USART3_DE_FUNC           125
#define UART3_DE_FUNC            125
#define USART3_RTS_FUNC          126
#define UART3_RTS_FUNC           126
#define USART3_RX_FUNC           127
#define UART3_RX_FUNC            127
#define USART3_TX_FUNC           128
#define UART3_TX_FUNC            128
#define USART4_CK_FUNC           129
#define UART4_CK_FUNC            129
#define USART4_CTS_FUNC          130
#define UART4_CTS_FUNC           130
#define USART4_DE_FUNC           131
#define UART4_DE_FUNC            131
#define USART4_RTS_FUNC          132
#define UART4_RTS_FUNC           132
#define USART4_RX_FUNC           133
#define UART4_RX_FUNC            133
#define USART4_TX_FUNC           134
#define UART4_TX_FUNC            134
#define USB_NOE_FUNC             135

