dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f052_pinmux.h
# define PINMUX(gpio, func) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (func == USART2_CTS_FUNC          )) ?  1 : \
	((gpio == PA00) && (func == TIM2_CH1_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA00) && (func == TSC_G1_IO1_FUNC          )) ?  3 : \
	((gpio == PA00) && (func == USART4_TX_FUNC           )) ?  4 : \
	((gpio == PA00) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA01) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PA01) && (func == USART2_DE_FUNC           )) ?  1 : \
	((gpio == PA01) && (func == USART2_RTS_FUNC          )) ?  1 : \
	((gpio == PA01) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PA01) && (func == TSC_G1_IO2_FUNC          )) ?  3 : \
	((gpio == PA01) && (func == USART4_RX_FUNC           )) ?  4 : \
	((gpio == PA01) && (func == TIM15_CH1N_FUNC          )) ?  5 : \
	((gpio == PA02) && (func == TIM15_CH1_FUNC           )) ?  0 : \
	((gpio == PA02) && (func == USART2_TX_FUNC           )) ?  1 : \
	((gpio == PA02) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PA02) && (func == TSC_G1_IO3_FUNC          )) ?  3 : \
	((gpio == PA02) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA03) && (func == TIM15_CH2_FUNC           )) ?  0 : \
	((gpio == PA03) && (func == USART2_RX_FUNC           )) ?  1 : \
	((gpio == PA03) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PA03) && (func == TSC_G1_IO4_FUNC          )) ?  3 : \
	((gpio == PA04) && (func == I2S1_WS_FUNC             )) ?  0 : \
	((gpio == PA04) && (func == SPI1_NSS_FUNC            )) ?  0 : \
	((gpio == PA04) && (func == USART2_CK_FUNC           )) ?  1 : \
	((gpio == PA04) && (func == TSC_G2_IO1_FUNC          )) ?  3 : \
	((gpio == PA04) && (func == TIM14_CH1_FUNC           )) ?  4 : \
	((gpio == PA05) && (func == I2S1_CK_FUNC             )) ?  0 : \
	((gpio == PA05) && (func == SPI1_SCK_FUNC            )) ?  0 : \
	((gpio == PA05) && (func == CEC_FUNC                 )) ?  1 : \
	((gpio == PA05) && (func == TIM2_CH1_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA05) && (func == TSC_G2_IO2_FUNC          )) ?  3 : \
	((gpio == PA06) && (func == I2S1_MCK_FUNC            )) ?  0 : \
	((gpio == PA06) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PA06) && (func == TIM3_CH1_FUNC            )) ?  1 : \
	((gpio == PA06) && (func == TIM1_BKIN_FUNC           )) ?  2 : \
	((gpio == PA06) && (func == TSC_G2_IO3_FUNC          )) ?  3 : \
	((gpio == PA06) && (func == USART3_CTS_FUNC          )) ?  4 : \
	((gpio == PA06) && (func == TIM16_CH1_FUNC           )) ?  5 : \
	((gpio == PA06) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PA06) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA07) && (func == I2S1_SD_FUNC             )) ?  0 : \
	((gpio == PA07) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PA07) && (func == TIM3_CH2_FUNC            )) ?  1 : \
	((gpio == PA07) && (func == TIM1_CH1N_FUNC           )) ?  2 : \
	((gpio == PA07) && (func == TSC_G2_IO4_FUNC          )) ?  3 : \
	((gpio == PA07) && (func == TIM14_CH1_FUNC           )) ?  4 : \
	((gpio == PA07) && (func == TIM17_CH1_FUNC           )) ?  5 : \
	((gpio == PA07) && (func == EVENTOUT_FUNC            )) ?  6 : \
	((gpio == PA07) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA08) && (func == RCC_MCO_FUNC             )) ?  0 : \
	((gpio == PA08) && (func == USART1_CK_FUNC           )) ?  1 : \
	((gpio == PA08) && (func == TIM1_CH1_FUNC            )) ?  2 : \
	((gpio == PA08) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PA08) && (func == CRS_SYNC_FUNC            )) ?  4 : \
	((gpio == PA09) && (func == TIM15_BKIN_FUNC          )) ?  0 : \
	((gpio == PA09) && (func == USART1_TX_FUNC           )) ?  1 : \
	((gpio == PA09) && (func == TIM1_CH2_FUNC            )) ?  2 : \
	((gpio == PA09) && (func == TSC_G4_IO1_FUNC          )) ?  3 : \
	((gpio == PA10) && (func == TIM17_BKIN_FUNC          )) ?  0 : \
	((gpio == PA10) && (func == USART1_RX_FUNC           )) ?  1 : \
	((gpio == PA10) && (func == TIM1_CH3_FUNC            )) ?  2 : \
	((gpio == PA10) && (func == TSC_G4_IO2_FUNC          )) ?  3 : \
	((gpio == PA11) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PA11) && (func == USART1_CTS_FUNC          )) ?  1 : \
	((gpio == PA11) && (func == TIM1_CH4_FUNC            )) ?  2 : \
	((gpio == PA11) && (func == TSC_G4_IO3_FUNC          )) ?  3 : \
	((gpio == PA11) && (func == CAN_RX_FUNC              )) ?  4 : \
	((gpio == PA11) && (func == COMP1_OUT_FUNC           )) ?  7 : \
	((gpio == PA12) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PA12) && (func == USART1_DE_FUNC           )) ?  1 : \
	((gpio == PA12) && (func == USART1_RTS_FUNC          )) ?  1 : \
	((gpio == PA12) && (func == TIM1_ETR_FUNC            )) ?  2 : \
	((gpio == PA12) && (func == TSC_G4_IO4_FUNC          )) ?  3 : \
	((gpio == PA12) && (func == CAN_TX_FUNC              )) ?  4 : \
	((gpio == PA12) && (func == COMP2_OUT_FUNC           )) ?  7 : \
	((gpio == PA13) && (func == SYS_SWDIO_FUNC           )) ?  0 : \
	((gpio == PA13) && (func == IR_OUT_FUNC              )) ?  1 : \
	((gpio == PA13) && (func == USB_NOE_FUNC             )) ?  2 : \
	((gpio == PA14) && (func == SYS_SWCLK_FUNC           )) ?  0 : \
	((gpio == PA14) && (func == USART2_TX_FUNC           )) ?  1 : \
	((gpio == PA15) && (func == I2S1_WS_FUNC             )) ?  0 : \
	((gpio == PA15) && (func == SPI1_NSS_FUNC            )) ?  0 : \
	((gpio == PA15) && (func == USART2_RX_FUNC           )) ?  1 : \
	((gpio == PA15) && (func == TIM2_CH1_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == TIM2_ETR_FUNC            )) ?  2 : \
	((gpio == PA15) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PA15) && (func == USART4_DE_FUNC           )) ?  4 : \
	((gpio == PA15) && (func == USART4_RTS_FUNC          )) ?  4 : \
	((gpio == PB00) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PB00) && (func == TIM3_CH3_FUNC            )) ?  1 : \
	((gpio == PB00) && (func == TIM1_CH2N_FUNC           )) ?  2 : \
	((gpio == PB00) && (func == TSC_G3_IO2_FUNC          )) ?  3 : \
	((gpio == PB00) && (func == USART3_CK_FUNC           )) ?  4 : \
	((gpio == PB01) && (func == TIM14_CH1_FUNC           )) ?  0 : \
	((gpio == PB01) && (func == TIM3_CH4_FUNC            )) ?  1 : \
	((gpio == PB01) && (func == TIM1_CH3N_FUNC           )) ?  2 : \
	((gpio == PB01) && (func == TSC_G3_IO3_FUNC          )) ?  3 : \
	((gpio == PB01) && (func == USART3_DE_FUNC           )) ?  4 : \
	((gpio == PB01) && (func == USART3_RTS_FUNC          )) ?  4 : \
	((gpio == PB02) && (func == TSC_G3_IO4_FUNC          )) ?  3 : \
	((gpio == PB03) && (func == I2S1_CK_FUNC             )) ?  0 : \
	((gpio == PB03) && (func == SPI1_SCK_FUNC            )) ?  0 : \
	((gpio == PB03) && (func == EVENTOUT_FUNC            )) ?  1 : \
	((gpio == PB03) && (func == TIM2_CH2_FUNC            )) ?  2 : \
	((gpio == PB03) && (func == TSC_G5_IO1_FUNC          )) ?  3 : \
	((gpio == PB04) && (func == I2S1_MCK_FUNC            )) ?  0 : \
	((gpio == PB04) && (func == SPI1_MISO_FUNC           )) ?  0 : \
	((gpio == PB04) && (func == TIM3_CH1_FUNC            )) ?  1 : \
	((gpio == PB04) && (func == EVENTOUT_FUNC            )) ?  2 : \
	((gpio == PB04) && (func == TSC_G5_IO2_FUNC          )) ?  3 : \
	((gpio == PB04) && (func == TIM17_BKIN_FUNC          )) ?  5 : \
	((gpio == PB05) && (func == I2S1_SD_FUNC             )) ?  0 : \
	((gpio == PB05) && (func == SPI1_MOSI_FUNC           )) ?  0 : \
	((gpio == PB05) && (func == TIM3_CH2_FUNC            )) ?  1 : \
	((gpio == PB05) && (func == TIM16_BKIN_FUNC          )) ?  2 : \
	((gpio == PB05) && (func == I2C1_SMBA_FUNC           )) ?  3 : \
	((gpio == PB06) && (func == USART1_TX_FUNC           )) ?  0 : \
	((gpio == PB06) && (func == I2C1_SCL_FUNC            )) ?  1 : \
	((gpio == PB06) && (func == TIM16_CH1N_FUNC          )) ?  2 : \
	((gpio == PB06) && (func == TSC_G5_IO3_FUNC          )) ?  3 : \
	((gpio == PB07) && (func == USART1_RX_FUNC           )) ?  0 : \
	((gpio == PB07) && (func == I2C1_SDA_FUNC            )) ?  1 : \
	((gpio == PB07) && (func == TIM17_CH1N_FUNC          )) ?  2 : \
	((gpio == PB07) && (func == TSC_G5_IO4_FUNC          )) ?  3 : \
	((gpio == PB07) && (func == USART4_CTS_FUNC          )) ?  4 : \
	((gpio == PB08) && (func == CEC_FUNC                 )) ?  0 : \
	((gpio == PB08) && (func == I2C1_SCL_FUNC            )) ?  1 : \
	((gpio == PB08) && (func == TIM16_CH1_FUNC           )) ?  2 : \
	((gpio == PB08) && (func == TSC_SYNC_FUNC            )) ?  3 : \
	((gpio == PB08) && (func == CAN_RX_FUNC              )) ?  4 : \
	((gpio == PB09) && (func == IR_OUT_FUNC              )) ?  0 : \
	((gpio == PB09) && (func == I2C1_SDA_FUNC            )) ?  1 : \
	((gpio == PB09) && (func == TIM17_CH1_FUNC           )) ?  2 : \
	((gpio == PB09) && (func == EVENTOUT_FUNC            )) ?  3 : \
	((gpio == PB09) && (func == CAN_TX_FUNC              )) ?  4 : \
	((gpio == PB09) && (func == I2S2_WS_FUNC             )) ?  5 : \
	((gpio == PB09) && (func == SPI2_NSS_FUNC            )) ?  5 : \
	((gpio == PB10) && (func == CEC_FUNC                 )) ?  0 : \
	((gpio == PB10) && (func == I2C2_SCL_FUNC            )) ?  1 : \
	((gpio == PB10) && (func == TIM2_CH3_FUNC            )) ?  2 : \
	((gpio == PB10) && (func == TSC_SYNC_FUNC            )) ?  3 : \
	((gpio == PB10) && (func == USART3_TX_FUNC           )) ?  4 : \
	((gpio == PB10) && (func == I2S2_CK_FUNC             )) ?  5 : \
	((gpio == PB10) && (func == SPI2_SCK_FUNC            )) ?  5 : \
	((gpio == PB11) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PB11) && (func == I2C2_SDA_FUNC            )) ?  1 : \
	((gpio == PB11) && (func == TIM2_CH4_FUNC            )) ?  2 : \
	((gpio == PB11) && (func == TSC_G6_IO1_FUNC          )) ?  3 : \
	((gpio == PB11) && (func == USART3_RX_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == I2S2_WS_FUNC             )) ?  0 : \
	((gpio == PB12) && (func == SPI2_NSS_FUNC            )) ?  0 : \
	((gpio == PB12) && (func == EVENTOUT_FUNC            )) ?  1 : \
	((gpio == PB12) && (func == TIM1_BKIN_FUNC           )) ?  2 : \
	((gpio == PB12) && (func == TSC_G6_IO2_FUNC          )) ?  3 : \
	((gpio == PB12) && (func == USART3_CK_FUNC           )) ?  4 : \
	((gpio == PB12) && (func == TIM15_BKIN_FUNC          )) ?  5 : \
	((gpio == PB13) && (func == I2S2_CK_FUNC             )) ?  0 : \
	((gpio == PB13) && (func == SPI2_SCK_FUNC            )) ?  0 : \
	((gpio == PB13) && (func == TIM1_CH1N_FUNC           )) ?  2 : \
	((gpio == PB13) && (func == TSC_G6_IO3_FUNC          )) ?  3 : \
	((gpio == PB13) && (func == USART3_CTS_FUNC          )) ?  4 : \
	((gpio == PB13) && (func == I2C2_SCL_FUNC            )) ?  5 : \
	((gpio == PB14) && (func == I2S2_MCK_FUNC            )) ?  0 : \
	((gpio == PB14) && (func == SPI2_MISO_FUNC           )) ?  0 : \
	((gpio == PB14) && (func == TIM15_CH1_FUNC           )) ?  1 : \
	((gpio == PB14) && (func == TIM1_CH2N_FUNC           )) ?  2 : \
	((gpio == PB14) && (func == TSC_G6_IO4_FUNC          )) ?  3 : \
	((gpio == PB14) && (func == USART3_DE_FUNC           )) ?  4 : \
	((gpio == PB14) && (func == USART3_RTS_FUNC          )) ?  4 : \
	((gpio == PB14) && (func == I2C2_SDA_FUNC            )) ?  5 : \
	((gpio == PB15) && (func == I2S2_SD_FUNC             )) ?  0 : \
	((gpio == PB15) && (func == SPI2_MOSI_FUNC           )) ?  0 : \
	((gpio == PB15) && (func == TIM15_CH2_FUNC           )) ?  1 : \
	((gpio == PB15) && (func == TIM1_CH3N_FUNC           )) ?  2 : \
	((gpio == PB15) && (func == TIM15_CH1N_FUNC          )) ?  3 : \
	((gpio == PC00) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC00) && (func == SYS_I2C_FUNC             )) ?  7 : \
	((gpio == PC01) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC01) && (func == SYS_SPI_FUNC             )) ?  7 : \
	((gpio == PC02) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC02) && (func == I2S2_MCK_FUNC            )) ?  1 : \
	((gpio == PC02) && (func == SPI2_MISO_FUNC           )) ?  1 : \
	((gpio == PC02) && (func == SYS_USART_FUNC           )) ?  7 : \
	((gpio == PC03) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC03) && (func == I2S2_SD_FUNC             )) ?  1 : \
	((gpio == PC03) && (func == SPI2_MOSI_FUNC           )) ?  1 : \
	((gpio == PC03) && (func == SYS_SYSTEM_FUNC          )) ?  7 : \
	((gpio == PC04) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PC04) && (func == USART3_TX_FUNC           )) ?  1 : \
	((gpio == PC05) && (func == TSC_G3_IO1_FUNC          )) ?  0 : \
	((gpio == PC05) && (func == USART3_RX_FUNC           )) ?  1 : \
	((gpio == PC05) && (func == SYS_TOUCH_FUNC           )) ?  7 : \
	((gpio == PC06) && (func == TIM3_CH1_FUNC            )) ?  0 : \
	((gpio == PC06) && (func == SYS_TIM1_FUNC            )) ?  7 : \
	((gpio == PC07) && (func == TIM3_CH2_FUNC            )) ?  0 : \
	((gpio == PC07) && (func == SYS_TIM2_FUNC            )) ?  7 : \
	((gpio == PC08) && (func == TIM3_CH3_FUNC            )) ?  0 : \
	((gpio == PC08) && (func == SYS_TIM3_FUNC            )) ?  7 : \
	((gpio == PC09) && (func == TIM3_CH4_FUNC            )) ?  0 : \
	((gpio == PC09) && (func == SYS_TIM14_FUNC           )) ?  7 : \
	((gpio == PC10) && (func == USART4_TX_FUNC           )) ?  0 : \
	((gpio == PC10) && (func == USART3_TX_FUNC           )) ?  1 : \
	((gpio == PC10) && (func == SYS_TIM15_FUNC           )) ?  7 : \
	((gpio == PC11) && (func == USART4_RX_FUNC           )) ?  0 : \
	((gpio == PC11) && (func == USART3_RX_FUNC           )) ?  1 : \
	((gpio == PC11) && (func == SYS_TIM16_FUNC           )) ?  7 : \
	((gpio == PC12) && (func == USART4_CK_FUNC           )) ?  0 : \
	((gpio == PC12) && (func == USART3_CK_FUNC           )) ?  1 : \
	((gpio == PC12) && (func == SYS_TIM17_FUNC           )) ?  7 : \
	((gpio == PC13) && (func == CEC_FUNC                 )) ?  7 : \
	((gpio == PC13) && (func == SYS_IR_Out_FUNC          )) ?  7 : \
	((gpio == PC14) && (func == SYS_COMP_FUNC            )) ?  7 : \
	((gpio == PC14) && (func == SYS_DAC_FUNC             )) ?  7 : \
	((gpio == PC15) && (func == SYS_CAN_FUNC             )) ?  7 : \
	((gpio == PD00) && (func == CAN_RX_FUNC              )) ?  0 : \
	((gpio == PD00) && (func == I2S2_WS_FUNC             )) ?  1 : \
	((gpio == PD00) && (func == SPI2_NSS_FUNC            )) ?  1 : \
	((gpio == PD01) && (func == CAN_TX_FUNC              )) ?  0 : \
	((gpio == PD01) && (func == I2S2_CK_FUNC             )) ?  1 : \
	((gpio == PD01) && (func == SPI2_SCK_FUNC            )) ?  1 : \
	((gpio == PD02) && (func == TIM3_ETR_FUNC            )) ?  0 : \
	((gpio == PD02) && (func == USART3_DE_FUNC           )) ?  1 : \
	((gpio == PD02) && (func == USART3_RTS_FUNC          )) ?  1 : \
	((gpio == PD03) && (func == USART2_CTS_FUNC          )) ?  0 : \
	((gpio == PD03) && (func == I2S2_MCK_FUNC            )) ?  1 : \
	((gpio == PD03) && (func == SPI2_MISO_FUNC           )) ?  1 : \
	((gpio == PD04) && (func == USART2_DE_FUNC           )) ?  0 : \
	((gpio == PD04) && (func == USART2_RTS_FUNC          )) ?  0 : \
	((gpio == PD04) && (func == I2S2_SD_FUNC             )) ?  1 : \
	((gpio == PD04) && (func == SPI2_MOSI_FUNC           )) ?  1 : \
	((gpio == PD05) && (func == USART2_TX_FUNC           )) ?  0 : \
	((gpio == PD06) && (func == USART2_RX_FUNC           )) ?  0 : \
	((gpio == PD07) && (func == USART2_CK_FUNC           )) ?  0 : \
	((gpio == PD08) && (func == USART3_TX_FUNC           )) ?  0 : \
	((gpio == PD09) && (func == USART3_RX_FUNC           )) ?  0 : \
	((gpio == PD10) && (func == USART3_CK_FUNC           )) ?  0 : \
	((gpio == PD11) && (func == USART3_CTS_FUNC          )) ?  0 : \
	((gpio == PD12) && (func == USART3_DE_FUNC           )) ?  0 : \
	((gpio == PD12) && (func == USART3_RTS_FUNC          )) ?  0 : \
	((gpio == PD12) && (func == TSC_G8_IO1_FUNC          )) ?  1 : \
	((gpio == PD13) && (func == TSC_G8_IO2_FUNC          )) ?  1 : \
	((gpio == PD14) && (func == TSC_G8_IO3_FUNC          )) ?  1 : \
	((gpio == PD15) && (func == CRS_SYNC_FUNC            )) ?  0 : \
	((gpio == PD15) && (func == TSC_G8_IO4_FUNC          )) ?  1 : \
	((gpio == PE00) && (func == TIM16_CH1_FUNC           )) ?  0 : \
	((gpio == PE00) && (func == EVENTOUT_FUNC            )) ?  1 : \
	((gpio == PE01) && (func == TIM17_CH1_FUNC           )) ?  0 : \
	((gpio == PE01) && (func == EVENTOUT_FUNC            )) ?  1 : \
	((gpio == PE02) && (func == TIM3_ETR_FUNC            )) ?  0 : \
	((gpio == PE02) && (func == TSC_G7_IO1_FUNC          )) ?  1 : \
	((gpio == PE03) && (func == TIM3_CH1_FUNC            )) ?  0 : \
	((gpio == PE03) && (func == TSC_G7_IO2_FUNC          )) ?  1 : \
	((gpio == PE04) && (func == TIM3_CH2_FUNC            )) ?  0 : \
	((gpio == PE04) && (func == TSC_G7_IO3_FUNC          )) ?  1 : \
	((gpio == PE05) && (func == TIM3_CH3_FUNC            )) ?  0 : \
	((gpio == PE05) && (func == TSC_G7_IO4_FUNC          )) ?  1 : \
	((gpio == PE06) && (func == TIM3_CH4_FUNC            )) ?  0 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  0 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  0 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  0 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  0 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  0 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  0 : \
	((gpio == PE12) && (func == I2S1_WS_FUNC             )) ?  1 : \
	((gpio == PE12) && (func == SPI1_NSS_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  0 : \
	((gpio == PE13) && (func == I2S1_CK_FUNC             )) ?  1 : \
	((gpio == PE13) && (func == SPI1_SCK_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  0 : \
	((gpio == PE14) && (func == I2S1_MCK_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == SPI1_MISO_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  0 : \
	((gpio == PE15) && (func == I2S1_SD_FUNC             )) ?  1 : \
	((gpio == PE15) && (func == SPI1_MOSI_FUNC           )) ?  1 : \
	((gpio == PF00) && (func == CRS_SYNC_FUNC            )) ?  0 : \
	((gpio == PF02) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PF03) && (func == EVENTOUT_FUNC            )) ?  0 : \
	((gpio == PF09) && (func == TIM15_CH1_FUNC           )) ?  0 : \
	((gpio == PF10) && (func == TIM15_CH2_FUNC           )) ?  0 : \
	AF_NO_SUCH_PINFUNC)

